StackedModel(
  (models): ModuleDict(
    (encoder): ANNModel(
      (layers): ModuleDict(
        (fc1): Linear(in_features=23, out_features=400, bias=True)
        (fc1_act): ELU(alpha=1.0)
        (fc2): Linear(in_features=400, out_features=387, bias=True)
        (fc2_act): ELU(alpha=1.0)
        (fc3): Linear(in_features=387, out_features=380, bias=True)
        (fc3_act): ELU(alpha=1.0)
        (fc4): Linear(in_features=380, out_features=373, bias=True)
        (fc4_act): ELU(alpha=1.0)
        (fc5): Linear(in_features=373, out_features=367, bias=True)
        (fc5_act): ELU(alpha=1.0)
        (fc6): Linear(in_features=367, out_features=360, bias=True)
        (fc6_act): ELU(alpha=1.0)
        (fc7): Linear(in_features=360, out_features=353, bias=True)
        (fc7_act): ELU(alpha=1.0)
        (fc8): Linear(in_features=353, out_features=347, bias=True)
        (fc8_act): ELU(alpha=1.0)
        (fc9): Linear(in_features=347, out_features=340, bias=True)
        (fc9_act): ELU(alpha=1.0)
        (fc10): Linear(in_features=340, out_features=333, bias=True)
        (fc10_act): ELU(alpha=1.0)
        (fc11): Linear(in_features=333, out_features=327, bias=True)
        (fc11_act): ELU(alpha=1.0)
        (fc12): Linear(in_features=327, out_features=320, bias=True)
        (fc12_act): ELU(alpha=1.0)
        (fc13): Linear(in_features=320, out_features=313, bias=True)
        (fc13_act): ELU(alpha=1.0)
        (fc14): Linear(in_features=313, out_features=306, bias=True)
        (fc14_act): ELU(alpha=1.0)
        (fc15): Linear(in_features=306, out_features=300, bias=True)
        (fc15_act): ELU(alpha=1.0)
        (fc16): Linear(in_features=300, out_features=293, bias=True)
        (fc16_act): ELU(alpha=1.0)
        (fc17): Linear(in_features=293, out_features=286, bias=True)
        (fc17_act): ELU(alpha=1.0)
        (fc18): Linear(in_features=286, out_features=279, bias=True)
        (fc18_act): ELU(alpha=1.0)
        (fc19): Linear(in_features=279, out_features=273, bias=True)
        (fc19_act): ELU(alpha=1.0)
        (fc20): Linear(in_features=273, out_features=266, bias=True)
        (fc20_act): ELU(alpha=1.0)
        (fc21): Linear(in_features=266, out_features=259, bias=True)
        (fc21_act): ELU(alpha=1.0)
        (fc22): Linear(in_features=259, out_features=252, bias=True)
        (fc22_act): ELU(alpha=1.0)
        (fc23): Linear(in_features=252, out_features=245, bias=True)
        (fc23_act): ELU(alpha=1.0)
        (fc24): Linear(in_features=245, out_features=239, bias=True)
        (fc24_act): ELU(alpha=1.0)
        (fc25): Linear(in_features=239, out_features=232, bias=True)
        (fc25_act): ELU(alpha=1.0)
        (fc26): Linear(in_features=232, out_features=225, bias=True)
        (fc26_act): ELU(alpha=1.0)
        (fc27): Linear(in_features=225, out_features=218, bias=True)
        (fc27_act): ELU(alpha=1.0)
        (fc28): Linear(in_features=218, out_features=211, bias=True)
        (fc28_act): ELU(alpha=1.0)
        (fc29): Linear(in_features=211, out_features=204, bias=True)
        (fc29_act): ELU(alpha=1.0)
        (fc30): Linear(in_features=204, out_features=197, bias=True)
        (fc30_act): ELU(alpha=1.0)
        (fc31): Linear(in_features=197, out_features=190, bias=True)
        (fc31_act): ELU(alpha=1.0)
        (fc32): Linear(in_features=190, out_features=184, bias=True)
        (fc32_act): ELU(alpha=1.0)
        (fc33): Linear(in_features=184, out_features=177, bias=True)
        (fc33_act): ELU(alpha=1.0)
        (fc34): Linear(in_features=177, out_features=170, bias=True)
        (fc34_act): ELU(alpha=1.0)
        (fc35): Linear(in_features=170, out_features=163, bias=True)
        (fc35_act): ELU(alpha=1.0)
        (fc36): Linear(in_features=163, out_features=156, bias=True)
        (fc36_act): ELU(alpha=1.0)
        (fc37): Linear(in_features=156, out_features=149, bias=True)
        (fc37_act): ELU(alpha=1.0)
        (fc38): Linear(in_features=149, out_features=142, bias=True)
        (fc38_act): ELU(alpha=1.0)
        (fc39): Linear(in_features=142, out_features=135, bias=True)
        (fc39_act): ELU(alpha=1.0)
        (fc40): Linear(in_features=135, out_features=128, bias=True)
        (fc40_act): Identity()
      )
    )
    (grade): ANNModel(
      (layers): ModuleDict(
        (fc1): Linear(in_features=128, out_features=7, bias=True)
        (fc1_act): ELU(alpha=1.0)
        (fc2): Linear(in_features=7, out_features=5, bias=True)
        (fc2_act): ELU(alpha=1.0)
        (fc3): Linear(in_features=5, out_features=3, bias=True)
        (fc3_act): Sigmoid()
      )
    )
    (optical): ANNModel(
      (layers): ModuleDict(
        (fc1): Linear(in_features=128, out_features=7, bias=True)
        (fc1_act): ELU(alpha=1.0)
        (fc2): Linear(in_features=7, out_features=5, bias=True)
        (fc2_act): ELU(alpha=1.0)
        (fc3): Linear(in_features=5, out_features=3, bias=True)
        (fc3_act): Sigmoid()
      )
    )
    (tensile): ANNModel(
      (layers): ModuleDict(
        (fc1): Linear(in_features=128, out_features=8, bias=True)
        (fc1_act): ELU(alpha=1.0)
        (fc2): Linear(in_features=8, out_features=6, bias=True)
        (fc2_act): ELU(alpha=1.0)
        (fc3): Linear(in_features=6, out_features=4, bias=True)
        (fc3_act): ReLU()
      )
    )
    (fire): ANNModel(
      (layers): ModuleDict(
        (fc1): Linear(in_features=128, out_features=5, bias=True)
        (fc1_act): ELU(alpha=1.0)
        (fc2): Linear(in_features=5, out_features=3, bias=True)
        (fc2_act): ELU(alpha=1.0)
        (fc3): Linear(in_features=3, out_features=1, bias=True)
        (fc3_act): Sigmoid()
      )
    )
  )
)